export type ContentCardData = {
    topTitle: string;
    content: [
        {title: string},
        {img: string} | {text: string[]},
        {img: string} | {text: string[]},
        {img: string} | {text: string[]}
    ];
    buttonPageLink?: string;
    buttonScrollLink?: string;
    buttonText: string;
    accentColor: string;
    accentColor1: string;
    aspectRatio?: string;
};

const pirmaryColor = '#76B82A';
const accentColor = '#2E3B8B';

export const infoCardsContent: ContentCardData[] = [
    {
        'topTitle': 'Поливни системи',
        'content': [
            {
                'title':
                    'Поливни макари и високонапорни помпи за селското стопанство',
            },
            {
                'img': 'cardImg1',
            },
            {
                'text': [
                    'Поливните макари осигуряват възможност за доставяне на вода директно до посевите. Това е особено полезно по време на сухи периоди или в области с ограничени водни ресурси. Растенията получават необходимото количество вода за растеж и развитие, което подобрява тяхната продуктивност и качество.',
                    '',
                ],
            },
            {
                'text': [
                    ' Поливните макари могат да осигурят равномерно разпределение на водата върху посевите. Така се избягва неравномерното поливане и създаването на зони с прекалено много или малко вода. Това допринася за оптимално използване на водата и намаляване на нежеланите отпадъци.  ',
                ],
            },
        ],
        'buttonPageLink': '/gallery',
        'buttonScrollLink': '',
        'buttonText': 'Галерия',
        'accentColor': pirmaryColor,
        'accentColor1': accentColor,
    },
    {
        'topTitle': 'За Нидерландия',
        'content': [
            {
                'title': 'Почти 3 пъти по-малка по площ от България, но ...',
            },
            {
                'img': 'cardImg2',
            },
            {
                'text': [
                    'Според статистиката Нидерландия е вторият най-голям износител в света на селскостопанска продукция. В момента повече от половината от земеделската земя се използва за отглеждане на храни. Успешното развитие и производство се дължи на използването на най-новите технологии и машини.',
                ],
            },
            {
                'text': [
                    'Поради постоянното иновативно развитие на местните фермери, често на вторичния пазар се появяват интересни оферти за качествено земеделско оборудване втора употреба. Но изгодните оферти цена/качество се продават бързо... ',
                ],
            },
        ],
        'buttonPageLink': '/contact',
        'buttonScrollLink': '',
        'buttonText': 'Контакт',
        'accentColor': pirmaryColor,
        'accentColor1': accentColor,
    },
    {
        'topTitle': 'Agro-machines.nl',
        'content': [
            {
                'title':
                    'Поливни системи и селскостопански машини по заявка от Нидерландия',
            },
            {
                'img': 'cardImg3',
            },
            {
                'text': [
                    'Ние сме специализирани в инспекцията и доставката на поливни макари втора употреба и високо-напорни помпи за тях, прикачна земеделска техника и трактори. Всяка седмица се появяват много нови оферти. Но както при всеки продукт има качествени и запазени, а има и доста амортизирани, които не си заслужават парите.',
                ],
            },
            {
                'text': [
                    'Ние следим актуалните оферти. При заявка търсим и възможности, чрез нашата изградена мрежа от земеделски кооперации, специализирани партньорски фирми от Нидерландия и местни фермери. Проверяваме състоянието, закупуваме и доставяме до България по поръчка системи за напояване на най-изгодни цени. ',
                ],
            },
        ],
        'buttonPageLink': '/offers',
        'buttonScrollLink': '',
        'buttonText': 'Актуални оферти',
        'accentColor': pirmaryColor,
        'accentColor1': accentColor,
    },
];
