export type ContentCardData = {
    topTitle: string;
    content: [
        {title: string},
        {img: string} | {text: string[]},
        {img: string} | {text: string[]},
        {img: string} | {text: string[]}
    ];
    buttonPageLink?: string;
    buttonScrollLink?: string;
    buttonText: string;
    accentColor: string;
    accentColor1: string;
    aspectRatio?: string;
};

export const infoCardsContent: ContentCardData[] = [
    {
        'topTitle': 'Поливни системи',
        'content': [
            {
                'title': 'за селското стопанство',
            },
            {
                'img': 'cardImg1',
            },
            {
                'text': [
                    'Поливните макари осигуряват възможност за доставяне на вода директно до посевите. Това е особено полезно по време на сухи периоди или в области с ограничени водни ресурси. Растенията получават необходимото количество вода за растеж и развитие, което подобрява тяхната продуктивност и качество.',
                    '',
                ],
            },
            {
                'text': [
                    ' Поливните макари могат да осигурят равномерно разпределение на водата върху посевите. Така се избягва неравномерното поливане и създаването на зони с прекалено много или малко вода. Това допринася за оптимално използване на водата и намаляване на нежеланите отпадъци.  ',
                ],
            },
        ],
        'buttonPageLink': '/gallery',
        'buttonScrollLink': '',
        'buttonText': 'Галерия',
        'accentColor': '#0088cc',
        'accentColor1': '#3f2b96',
    },
    {
        'topTitle': 'За Нидерландия',
        'content': [
            {
                'title': '2.5 по-малка от България',
            },
            {
                'img': 'cardImg2',
            },
            {
                'text': [
                    'Но според статистиката Нидерландия е вторият най-голям износител в света на селскостопанска продукция. В момента повече от половината от земеделската земя се използва за отглеждане на храни. Успешното развитие и производство се дължи на използването на най-новите технологии и машини.',
                ],
            },
            {
                'text': [
                    'Поради постоянното иновативно развитие на местните фермери, често на вторичния пазар се появяват интересни оферти за качествено замеделско оборудване втора употреба. Но изгодните оферти цена/качество се продават бързо... ',
                ],
            },
        ],
        'buttonPageLink': '/contact',
        'buttonScrollLink': '',
        'buttonText': 'Контакт',
        'accentColor': '#0088cc',
        'accentColor1': '#3f2b96',
    },
    {
        'topTitle': 'Поливни системи',
        'content': [
            {
                'title': 'от Agro-machines.nl',
            },
            {
                'img': 'cardImg3',
            },
            {
                'text': [
                    'Ние сме специализирани в инспекцията и доставката на поливни макари втора употреба и високо-напорни помпи за тях. Всяка седмица се появяват много нови оферти. Но както при всеки продукт има качествени и запазени, а има и доста амортизирани, които не си заслужават парите. Ние следим актуалните оферти.',
                ],
            },
            {
                'text': [
                    'Търсим и други възможни, чрез нашата мрежа. Проверяваме състоянието, закупуваме и доставяме до България по поръчка системи за напояване на най-изгодни цени. ',
                ],
            },
        ],
        'buttonPageLink': '/offers',
        'buttonScrollLink': '',
        'buttonText': 'Актуални оферти',
        'accentColor': '#0088cc',
        'accentColor1': '#3f2b96',
    },
];
